DingoOz/micro_ros_ethernet_esp32p4/sdkconfig.defaults
# Target: ESP32-P4
CONFIG_IDF_TARGET="esp32p4"

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="32MB"
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y

# PSRAM - disabled for initial testing
# Enable once PSRAM type/speed is confirmed for the board
# CONFIG_SPIRAM=y

# Ethernet EMAC + IP101GRI PHY (Waveshare ESP32-P4-WiFi6-PoE-ETH)
CONFIG_ETH_USE_ESP32_EMAC=y
CONFIG_ETH_PHY_INTERFACE_RMII=y

# FreeRTOS
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=y
CONFIG_FREERTOS_USE_STATS_FORMATTING_FUNCTIONS=y
CONFIG_FREERTOS_VTASKDELAY_VALUE_RANGE=y
CONFIG_FREERTOS_USE_TRACE_FACILITY=y
CONFIG_FREERTOS_TLSP_DELETION_CALLBACKS=y

# Temperature sensor
CONFIG_SOC_TEMP_SENSOR_SUPPORTED=y

# Heap
CONFIG_HEAP_TRACING_OFF=y

# micro-ROS needs this
CONFIG_MICRO_ROS_ESP_XRCE_DDS_MIDDLEWARE=y
CONFIG_MICRO_ROS_ESP_NETIF_WLAN=n

# Increase main task stack
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# Console on USB-Serial-JTAG (ttyACM0)
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_USB_SERIAL_JTAG=y

# System
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_400=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ=400
